package ssu.eatssu.domain.auth.util;

import org.springframework.stereotype.Component;

import java.util.UUID;
import java.util.concurrent.ThreadLocalRandom;

@Component
public class RandomNicknameUtil {

    private static final String[] PREFIX = {
            "덜익은", "잘익은", "타버린", "밍밍한", "짭짤한", "달달한", "씁쓸한", "매콤한", "얼큰한", "구수한",
            "새콤한", "상큼한", "고소한", "담백한", "느끼한", "촉촉한", "바삭한", "쫄깃한", "꾸덕한", "진한",
            "깔끔한", "시원한", "은은한", "중독적인", "화끈한", "감칠한", "개운한", "살짝탄", "부드러운", "향긋한",
            "자극적인", "산뜻한", "짙은", "진득한", "기름진", "살짝매운", "은근한", "쌉쌀한", "따뜻한", "식어버린",
            "따끈한", "시큼한", "고급진", "정겨운", "친숙한", "투박한", "소박한", "짠내나는", "심심한", "묵직한",
            "포근한", "통통한", "말랑한", "폭신한", "몽글한", "보들한", "꼬숩한", "달콤한", "쫀득한", "도톰한",
            "부들한", "귀여운", "탱글한", "포슬한", "말캉한", "보송한", "탱탱한", "보드라운", "살짝단", "순한",
            "푸근한", "따스한", "도리도리한", "통실한", "쫄깃짠", "말랑짠", "꼬들한", "탱글짠", "보드짠", "포근짠",
            "귀염한", "소프트한", "도톰짠", "살포시한", "오동통한", "말랑짭짤", "탱탱짭조름", "쫀쫀한", "통통짭짤", "귀엽짭짤",
            "말캉짭짤", "부들짭조름", "포슬짭조름", "도톰짭짤", "몽글짭조름", "탱글달달", "보들짭조름", "통실짭짤", "말캉달달", "보송짭짤"
    };

    private static final String[] MENU_NAME = {
            "등심돈가스","콥샐러드","팟타이","김치찌개","단호박죽","김치볶음밥","미소장국","총각김치","제육덮밥","단무지",
            "볶음김치","야채피클","나주곰탕","갈비탕","동태전","떡갈비조림","칠리탕수육","소고기국밥","콩나물밥","고구마맛탕",
            "계란찜","한식잡채","치킨너겟","타코야끼","비엔나볶음","떡볶이","두부장국","동지죽","감귤","야채튀김",
            "미니우동","챠슈덮밥","가츠동","새우튀김","탕수육강정","두부조림","부추전","검정콩밥","망고샐러드","비빔만두",
            "비빔밥","닭볶음탕","수수밥","쟁반짜장","깍두기","연근조림","멸치볶음","오이생채","감자조림", "순대볶음",
            "순대국밥","핫도그","소떡소떡","만두라면","찰흑미밥","차조밥","해물잡채","장어덮밥","비빔국수","김말이",
            "닭곰탕","우불고기","딸기쿠키","치킨텐더","냉메밀국수","가쓰오장국","간짜장밥","물만두국","오이피클","물만두찜",
            "카레라이스","얼큰김치국","군만두","연두부","가자미튀김","양장피","비빔쫄면","만두전골","비빔막국수","버섯불고기",
            "취나물밥","곰국","닭봉튀김","피자춘권","오징어튀김","육개장","콩나물국","새우까스","낙지비빔밥","도토리묵",
            "차돌짬뽕","목살갈비찜","들기름김","마라탕","간장찜닭","미니약과","파계란국","야끼소바","치즈고로케","설렁탕"
    };

    public String generate() {
        ThreadLocalRandom random = ThreadLocalRandom.current();

        String prefix = PREFIX[random.nextInt(PREFIX.length)];
        String category = MENU_NAME[random.nextInt(MENU_NAME.length)];

        return prefix + " " + category;
    }
}
